Ran Plan for dir: `ec2-jenkins` workspace: `default`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_instance.web has changed
~ resource "aws_instance" "web" {
        id                                   = "i-0ab5e02917d5809aa"
      - public_dns                           = "ec2-3-238-29-15.compute-1.amazonaws.com" -> null
        tags                                 = {
            "Managed_by" = "Terraform"
            "Name"       = "Jenkins"
        }
        # (29 unchanged attributes hidden)





        # (5 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.web must be replaced
-/+ resource "aws_instance" "web" {
      ~ ami                                  = "ami-0179d60c5b60d8475" -> "ami-01080f355d46c5b59" # forces replacement
      ~ arn                                  = "arn:aws:ec2:us-east-1:309950511952:instance/i-0ab5e02917d5809aa" -> (known after apply)
      ~ associate_public_ip_address          = false -> true # forces replacement
      ~ availability_zone                    = "us-east-1f" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      ~ id                                   = "i-0ab5e02917d5809aa" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "stopped" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ primary_network_interface_id         = "eni-06a2c0dad77ac8298" -> (known after apply)
      ~ private_dns                          = "ip-50-0-1-215.ec2.internal" -> (known after apply)
      ~ private_ip                           = "50.0.1.215" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
        tags                                 = {
            "Managed_by" = "Terraform"
            "Name"       = "Jenkins"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
        # (8 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 105 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-04265090cf2a490b8" -> (known after apply)
          ~ volume_size           = 35 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

  # local_file.ssh_key will be created
+ resource "local_file" "ssh_key" {
      + content              = (sensitive)
      + directory_permission = "700"
      + file_permission      = "400"
      + filename             = "./keys/key-key.pem"
      + id                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

Changes to Outputs:
~ ami        = "ami-0179d60c5b60d8475" -> "ami-01080f355d46c5b59"
~ arn        = "arn:aws:ec2:us-east-1:309950511952:instance/i-0ab5e02917d5809aa" -> (known after apply)
~ id         = "i-0ab5e02917d5809aa" -> (known after apply)
~ public-dns = "ec2-3-238-29-15.compute-1.amazonaws.com" -> (known after apply)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d ec2-jenkins`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.patomagico.com.br/lock?id=antoniocivc%252Fprojeto-padawan%252Fec2-jenkins%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d ec2-jenkins -- -var=key_name=key-key`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 2 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
